import type { Lang } from "./language";

const DICT = {
  dictionary: {
    ua: "Словник",
    ru: "Словарь",
  },
  grammar: {
    ua: "Граматика",
    ru: "Грамматика",
  },
  practice: {
    ua: "Тренажер",
    ru: "Тренировка",
  },
  learnTitle: {
    ua: "Вивчай словацьку 🇸🇰 просто й системно",
    ru: "Учи словацкий 🇸🇰 просто и системно",
  },
  goLearn: {
    ua: "Перейти до навчання",
    ru: "Перейти к обучению",
  },
};

export function t(key: keyof typeof DICT, lang: Lang) {
  return DICT[key][lang];
}
