export type UpdateItem = {
    date: string; // "2026-02-15"
    title: { ua: string; ru: string };
    items: { ua: string[]; ru: string[] };
};


export const UPDATES: UpdateItem[] = [
    {
        date: "2026-02-15",
        title: {
            ua: "Покращено сторінку «Оновлення»",
            ru: "Улучшена страница «Обновления»",
        },
        items: {
            ua: [
                "Додано архів оновлень із групуванням по місяцях",
                "Можна перемикатися між оновленнями без перезавантаження сторінки",
                "На головній сторінці зʼявилася кнопка «Що нового»",
                "Покращена швидкість загрузки фото",
            ],
            ru: [
                "Добавлен архив обновлений с группировкой по месяцам",
                "Можно переключаться между обновлениями без перезагрузки страницы",
                "На главной странице появилась кнопка «Что нового»",
                "Улучшена скорость загрузки фото",
            ],
        },
    }]

